# Lektion 4 - 2025-09-05

### Pandas biblioteket

Importera Pandas med alias **pd**

In [1]:
import pandas as pd

Läsa in data från en lista med dictionaries

Dictionary med data om golf klubbor

In [2]:
golf_data = [
    {
        "product_id": "02005A0F0A0I",
        "product_name": "Callaway Elyte Fairwaywood 7",
        "loft_deg": "21",
        "shaft_model": "Denali Charcoal 60",
        "orientation": "Right",
        "adjustable_loft": True,
        "headcover_included": True,
        "price_sek": 4499.00,
        "in_stock": False,
    },
    {
        "product_id": "TMST2D105R",
        "product_name": "TaylorMade Stealth 2 Driver 10.5",
        "loft_deg": "10.5",
        "shaft_model": "Ventus Red 5R",
        "orientation": "Right",
        "adjustable_loft": True,
        "headcover_included": True,
        "price_sek": 5999.00,
        "in_stock": True,
    },
    {
        "product_id": "TTTSR2F3R",
        "product_name": "Titleist TSR2 Fairway 3",
        "loft_deg": "15",
        "shaft_model": "HZRDUS Red 60",
        "orientation": "Right",
        "adjustable_loft": True,
        "headcover_included": True,
        "price_sek": 4299.00,
        "in_stock": True,
    },
    {
        "product_id": "PINGG430H4L",
        "product_name": "Ping G430 Hybrid 4",
        "loft_deg": "22",
        "shaft_model": "Alta CB Black 70",
        "orientation": "Left",
        "adjustable_loft": True,
        "headcover_included": True,
        "price_sek": 3499.00,
        "in_stock": True,
    },
    {
        "product_id": "CBRAJ7IRR",
        "product_name": "Cobra Aerojet 7-Iron",
        "loft_deg": "30.5",
        "shaft_model": "KBS Tour 90",
        "orientation": "Right",
        "adjustable_loft": False,
        "headcover_included": False,
        "price_sek": 1299.00,
        "in_stock": True,
    },
    {
        "product_id": "MZT22W56R",
        "product_name": "Mizuno T22 Wedge 56°",
        "loft_deg": "56",
        "shaft_model": "Dynamic Gold S200",
        "orientation": "Right",
        "adjustable_loft": False,
        "headcover_included": False,
        "price_sek": 1699.00,
        "in_stock": False,
    },
]

Läsa in dictionaryt till ett Pandas DataFrame och lagra det i en variabel

In [3]:
golf_df = pd.DataFrame(golf_data)

In [4]:
golf_df

,product_id,product_name,loft_deg,shaft_model,orientation,adjustable_loft,headcover_included,price_sek,in_stock
0,02005A0F0A0I,Callaway Elyte Fairwaywood 7,21,Denali Charcoal 60,Right,True,True,4499.0,False
1,TMST2D105R,TaylorMade Stealth 2 Driver 10.5,10.5,Ventus Red 5R,Right,True,True,5999.0,True
2,TTTSR2F3R,Titleist TSR2 Fairway 3,15,HZRDUS Red 60,Right,True,True,4299.0,True
3,PINGG430H4L,Ping G430 Hybrid 4,22,Alta CB Black 70,Left,True,True,3499.0,True
4,CBRAJ7IRR,Cobra Aerojet 7-Iron,30.5,KBS Tour 90,Right,False,False,1299.0,True
5,MZT22W56R,Mizuno T22 Wedge 56°,56,Dynamic Gold S200,Right,False,False,1699.0,False

Vilken datatyp har ett Pandas DataFrame?

In [5]:
type(golf_df)

pandas.core.frame.DataFrame

### Från CSV

Skapa en variabel för sökvägen till csv filen `employees.csv`

In [6]:
data = "C:/VScode projects/Lektion1/employees.csv"

Läs in csv filen till ett Pandas DataFrame

In [7]:
df = pd.read_csv(data)

'head' visar dom första 5 raderna i DataFramet

In [8]:
df.head()

,First Name,Start Date,Last Login Time,Salary,Bonus %,Senior Management,Team
0,Douglas,8/6/1993,12:42 PM,97308,6.945,True,Marketing
1,Thomas,3/31/1996,6:53 AM,61933,4.170,True,NaN
2,Maria,4/23/1993,11:17 AM,130590,11.858,False,Finance
3,Jerry,3/4/2005,1:00 PM,138705,9.340,True,Finance
4,Larry,1/24/1998,4:47 PM,101004,1.389,True,Client Services

'columns' listar alla kolumnnamn i DataFramet

In [9]:
df.columns

Index(['First Name', 'Start Date', 'Last Login Time', 'Salary', 'Bonus %',
       'Senior Management', 'Team'],
      dtype='object')

Vi gillar inte hur kolumnnamnen ser ut, så vi städar upp dom och kör <span style="color: green"><strong>first_name</strong></span> stilen istället för <span style="color: orange"><strong>First Name</strong></span>

In [10]:
df.columns = df.columns.str.lower().str.replace(" ", "_")

'tail' visar dom sista 5 raderna i DataFramet

In [11]:
df.tail()

,first_name,start_date,last_login_time,salary,bonus_%,senior_management,team
995,Henry,11/23/2014,6:09 AM,132483,16.655,False,Distribution
996,Phillip,1/31/1984,6:30 AM,42392,19.675,False,Finance
997,Russell,5/20/2013,12:39 PM,96914,1.421,False,Product
998,Larry,4/20/2013,4:45 PM,60500,11.985,False,Business Development
999,Albert,5/15/2012,6:24 PM,129949,10.169,True,Sales

'shape' räknar rader och kolumner i DataFramet

In [12]:
df.shape

(1000, 7)

'info' ger information om kolumner, datatypes, nulls

In [13]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 7 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   first_name         933 non-null    object
 1   start_date         1000 non-null   object
 2   last_login_time    1000 non-null   object
 3   salary             1000 non-null   int64
 4   bonus_%            1000 non-null   float64
 5   senior_management  933 non-null    object
 6   team               957 non-null    object
dtypes: float64(1), int64(1), object(5)
memory usage: 54.8+ KB

'describe' visar statistik (bara på numeriska kolumner)

In [14]:
df.describe()

              salary      bonus_%
count    1000.000000  1000.000000
mean    90662.181000    10.207555
std     32923.693342     5.528481
min     35013.000000     1.015000
25%     62613.000000     5.401750
50%     90428.000000     9.838500
75%    118740.250000    14.838000
max    149908.000000    19.944000

'value_counts' är ett sätt att snabbt göra en "group by + count" på en kolumn

In [15]:
df["team"].value_counts()

team
Client Services         106
Finance                 102
Business Development    101
Marketing                98
Product                  95
Sales                    94
Engineering              92
Human Resources          91
Distribution             90
Legal                    88
Name: count, dtype: int64

Bonusstatistik per team <br>
Gruppera **team** kolumnen och beräkna medelvärdet från **bonus_%** kolumnen och sortera högst till lägst

In [16]:
(df
.groupby("team")["bonus_%"]
.mean()
)

team
Business Development    10.572376
Client Services         10.495104
Distribution             9.615644
Engineering             10.462989
Finance                 10.186873
Human Resources          9.993879
Legal                   10.322830
Marketing               10.353449
Product                  9.791484
Sales                   10.116915
Name: bonus_%, dtype: float64

Hur många unika värden finns det i **senior_management**?

In [17]:
df["senior_management"].unique()

array([True, False, nan], dtype=object)

Hur många anställda har True respektive False som värde i kolumnen **senior_management**

In [18]:
df["senior_management"].value_counts()

senior_management
True     468
False    465
Name: count, dtype: int64

Konvertera **senior_management** kolumnen från datatyp **object** (string) till **boolean** (true/false)

In [19]:
df["senior_management"] = df["senior_management"].astype("boolean")

Hur ser det ut nu?

In [20]:
print(df["senior_management"].dtype)

boolean

Samma resultat. Av vilken anledning blev inte kolumnen automatiskt en boolean vid inläsning och spelar det någon roll?

Vad har **start_date** för datatyp?

In [21]:
print(df["start_date"].dtype)

object

Omvandla 'start_date' till datum med Pandas funktion

In [22]:
df["start_date"] = pd.to_datetime(df["start_date"])

Testa för att se om det fungerade

In [23]:
print(df["start_date"].dtype)

datetime64[ns]

Skapa en ny kolumn **start_year** genom att extrahera år från **start_date**

In [24]:
df["start_year"] = df["start_date"].dt.year

In [25]:
df.head()

,first_name,start_date,last_login_time,salary,bonus_%,senior_management,team,start_year
0,Douglas,1993-08-06,12:42 PM,97308,6.945,True,Marketing,1993
1,Thomas,1996-03-31,6:53 AM,61933,4.170,True,NaN,1996
2,Maria,1993-04-23,11:17 AM,130590,11.858,False,Finance,1993
3,Jerry,2005-03-04,1:00 PM,138705,9.340,True,Finance,2005
4,Larry,1998-01-24,4:47 PM,101004,1.389,True,Client Services,1998

Group by + Count på **start_year** kolumnen, sorterar högst->lägst

In [26]:
(
df["start_year"]
 .value_counts()
 .sort_values(ascending=False)
 )

start_year
1995    44
2009    42
1999    37
2002    34
2007    33
1996    32
1984    32
2004    31
2005    31
2011    30
1980    30
2013    29
1997    29
2014    28
1986    28
2010    28
1982    28
1992    28
2012    28
1991    27
2003    26
2000    26
2006    26
2001    25
1988    25
2008    25
1994    24
2015    22
1990    22
1983    22
1981    21
1989    20
1993    19
1998    19
1985    18
1987    16
2016    15
Name: count, dtype: int64

'agg' för att aggregera värdet av en kolumn

In [27]:
df["salary"].agg(["min", "max", "mean", "std"])

min      35013.000000
max     149908.000000
mean     90662.181000
std      32923.693342
Name: salary, dtype: float64

Filtrera på en kolumn i DataFramet. Vi väljer ut kolumnen **bonus_%** och filtrerar på större än 10.

In [28]:
df[df["bonus_%"] > 10]

,first_name,start_date,last_login_time,salary,bonus_%,senior_management,team,start_year
2,Maria,1993-04-23,11:17 AM,130590,11.858,False,Finance,1993
5,Dennis,1987-04-18,1:35 AM,115163,10.125,False,Legal,1987
6,Ruby,1987-08-17,4:20 PM,65476,10.012,True,Product,1987
7,NaN,2015-07-20,10:43 AM,45906,11.598,<NA>,Finance,2015
8,Angela,2005-11-22,6:29 AM,95570,18.523,True,Engineering,2005
...,...,...,...,...,...,...,...,...
993,Tina,1997-05-15,3:53 PM,56450,19.040,True,Engineering,1997
995,Henry,2014-11-23,6:09 AM,132483,16.655,False,Distribution,2014
996,Phillip,1984-01-31,6:30 AM,42392,19.675,False,Finance,1984
998,Larry,2013-04-20,4:45 PM,60500,11.985,False,Business Development,2013
999,Albert,2012-05-15,6:24 PM,129949,10.169,True,Sales,2012

Filtreringsexempel: Hög lön + hög bonus

In [29]:
high_salary = df["salary"] > 100000
high_bonus = df["bonus_%"] > 10

df[high_salary & high_bonus].nlargest(5, "salary") # top 5

,first_name,start_date,last_login_time,salary,bonus_%,senior_management,team,start_year
644,Katherine,1996-08-13,12:21 AM,149908,18.912,False,Finance,1996
160,Kathy,2000-03-18,7:26 PM,149563,16.991,True,Finance,2000
793,Andrea,1999-07-22,9:25 AM,149105,13.707,True,Distribution,1999
981,James,1993-01-15,5:19 PM,148985,19.280,False,Legal,1993
800,Clarence,1989-08-05,6:11 PM,148941,11.517,False,Product,1989

SQL-aktigt sätt att filtrera ett DataFrame

In [30]:
df.query("salary > 10000 and `bonus_%` > 10")

,first_name,start_date,last_login_time,salary,bonus_%,senior_management,team,start_year
2,Maria,1993-04-23,11:17 AM,130590,11.858,False,Finance,1993
5,Dennis,1987-04-18,1:35 AM,115163,10.125,False,Legal,1987
6,Ruby,1987-08-17,4:20 PM,65476,10.012,True,Product,1987
7,NaN,2015-07-20,10:43 AM,45906,11.598,<NA>,Finance,2015
8,Angela,2005-11-22,6:29 AM,95570,18.523,True,Engineering,2005
...,...,...,...,...,...,...,...,...
993,Tina,1997-05-15,3:53 PM,56450,19.040,True,Engineering,1997
995,Henry,2014-11-23,6:09 AM,132483,16.655,False,Distribution,2014
996,Phillip,1984-01-31,6:30 AM,42392,19.675,False,Finance,1984
998,Larry,2013-04-20,4:45 PM,60500,11.985,False,Business Development,2013
999,Albert,2012-05-15,6:24 PM,129949,10.169,True,Sales,2012

Deklarera queries i variabler istället om du behöver återanvända vid tillfälle

In [31]:
query = "team in ['Finance']"

df.query(query)

,first_name,start_date,last_login_time,salary,bonus_%,senior_management,team,start_year
2,Maria,1993-04-23,11:17 AM,130590,11.858,False,Finance,1993
3,Jerry,2005-03-04,1:00 PM,138705,9.340,True,Finance,2005
7,NaN,2015-07-20,10:43 AM,45906,11.598,<NA>,Finance,2015
14,Kimberly,1999-01-14,7:13 AM,41426,14.543,True,Finance,1999
46,Bruce,2009-11-28,10:47 PM,114796,6.796,False,Finance,2009
...,...,...,...,...,...,...,...,...
907,Elizabeth,1998-07-27,11:12 AM,137144,10.081,False,Finance,1998
954,Joe,1980-01-19,4:06 PM,119667,1.148,True,Finance,1980
987,Gloria,2014-12-08,5:08 AM,136709,10.331,True,Finance,2014
992,Anthony,2011-10-16,8:35 AM,112769,11.625,True,Finance,2011
996,Phillip,1984-01-31,6:30 AM,42392,19.675,False,Finance,1984

Skapa ett nytt DataFrame baserat på en query från existerande DataFrame

In [32]:
df_finance = df.query(query)

Validering

In [33]:
df_finance["team"].unique()

array(['Finance'], dtype=object)

Spara till Excel

In [ ]:
df_finance.to_excel("C:/Users/jonat/OneDrive/BI25 Python/data/employees_finance.xlsx", index=False)

Vi vill göra en Group by på kolumnen **team** och räkna ut medelvärdet på **salary** <br>
Sedan plottar vi med Pandas (matplotlib under huven) fram en graf

Först räknar vi ut genomsnittlig lön per team och sorterar. Likvärdigt SQL exempel:

```sql
SELECT team, 
       AVG(salary) AS avg_salary
FROM df
GROUP BY team
ORDER BY avg_salary;

Pandas motsvarighet:

In [ ]:
df_avg_salary = df.groupby("team")["salary"].mean().sort_values()

In [ ]:
df_avg_salary.plot(
    kind='barh',
    title="Average Salary per Team",
    figsize=(6, 4)
)

Finns det ett samband mellan Lön och Bonus %?

In [ ]:
df.plot.scatter(
    x="salary", 
    y="bonus_%", 
    title="Lön och Bonus %", 
    figsize=(6, 4)
    )

#### Skapa nya kolumner för att analysera lön och bonus
- Vi vill ta fram top 5 och bottom 5 löner/bonusar på employee nivå <br>
- Vi börjar med att normalisera lön och bonus (värde mellan 0 och 1) <br>
- Sedan kombinerar vi till en **score** som är viktat (Lön väger 1 och Bonus väger 2) <br>

In [ ]:
# Normalisera lön och bonus
df["salary_norm"] = df["salary"] / df["salary"].max()
df["bonus_norm"] = df["bonus_%"] / df["bonus_%"].max()

# Kombinerat score (viktat)
df["score"] = df["salary_norm"] + 2 * df["bonus_norm"]

Välj vilka kolumner som ska vara med i det nya DataFramet

Skapa två variabler top5 respektive bottom5 med enda skillnaden ascending=True/False

In [ ]:
columns = ["first_name", "salary", "bonus_%", "team", "score"]

df_top5 = df.nlargest(5, "score")[columns]
df_bottom5 = df.nsmallest(5, "score")[columns]

Top 5

In [ ]:
df_top5

Bottom 5

In [ ]:
df_bottom5